pjclavero/Diana/firmware/esp32/test_host/tests/test_do_only.c
#include <string.h>

#include "diana/event.h"
#include "diana/sensors.h"
#include "diana/shiftreg.h"
#include "hal_host.h"
#include "test_util.h"

#define SPI2_HOST 2
#include "esp32s3_proto_do_w5500.h"

static uint16_t bit_for_target(uint8_t target)
{
    return (uint16_t)(1u << (target - 1u));
}

int run_do_only(void)
{
    TEST_SUITE("do_only");
    int before = g_tests_failed;

    diana_config cfg;
    diana_config_defaults(&cfg);
    diana_sensor_state st;
    diana_sensor_state_init(&st);

    SECTION("perfil DIANA_BOARD_PROTO_DO_W5500 sin ADC ni piezo analogico");
    CHECK_EQ_INT(DIANA_BOARD_PROTO_DO_W5500, 1, "perfil prototipo DO-only activo");
    CHECK_EQ_STR(DIANA_BOARD_NAME, "proto-do-w5500", "nombre de placa OTA");
    CHECK_EQ_INT(DIANA_PIN_LED_ROW0, 4, "GPIO4 LED fila D1-D3");
    CHECK_EQ_INT(DIANA_PIN_LED_ROW1, 5, "GPIO5 LED fila D4-D6");
    CHECK_EQ_INT(DIANA_PIN_LED_ROW2, 6, "GPIO6 LED fila D7-D9");
    CHECK_EQ_INT(DIANA_PIN_ETH_RST, 8, "GPIO8 W5500 RST");
    CHECK_EQ_INT(DIANA_PIN_ETH_INT, 9, "GPIO9 W5500 INT");
    CHECK_EQ_INT(DIANA_PIN_ETH_CS, 10, "GPIO10 W5500 CS");
    CHECK_EQ_INT(DIANA_PIN_ETH_MOSI, 11, "GPIO11 W5500 MOSI");
    CHECK_EQ_INT(DIANA_PIN_ETH_SCLK, 12, "GPIO12 W5500 SCK");
    CHECK_EQ_INT(DIANA_PIN_ETH_MISO, 13, "GPIO13 W5500 MISO");
    CHECK_EQ_INT(DIANA_PIN_SELECTOR_A, 15, "GPIO15 selector 1");
    CHECK_EQ_INT(DIANA_PIN_SELECTOR_B, 16, "GPIO16 selector 2");
    CHECK_EQ_INT(DIANA_PIN_BUTTON_ID, 17, "GPIO17 IDENTIFY");
    CHECK_EQ_INT(DIANA_PIN_HC165_DATA, 38, "GPIO38 HC165 DATA");
    CHECK_EQ_INT(DIANA_PIN_HC165_LOAD, 47, "GPIO47 HC165 LOAD");
    CHECK_EQ_INT(DIANA_PIN_HC165_CLK, 48, "GPIO48 HC165 CLK");
    /* Pines de reserva: NO se cablean en V1 y NO pueden solaparse con nada. */
    CHECK_EQ_INT(DIANA_PIN_RESERVED_IRQ_ANY, 7, "GPIO7 reservado IRQ_ANY, sin cablear");
    CHECK_EQ_INT(DIANA_PIN_RESERVED_A, 14, "GPIO14 libre (era nCS_ADC)");
    CHECK_EQ_INT(DIANA_PIN_RESERVED_B, 21, "GPIO21 libre (era VREF_TH_PWM)");
    {
        const int usados[] = {
            DIANA_PIN_LED_ROW0, DIANA_PIN_LED_ROW1, DIANA_PIN_LED_ROW2,
            DIANA_PIN_ETH_RST, DIANA_PIN_ETH_INT, DIANA_PIN_ETH_CS,
            DIANA_PIN_ETH_MOSI, DIANA_PIN_ETH_SCLK, DIANA_PIN_ETH_MISO,
            DIANA_PIN_SELECTOR_A, DIANA_PIN_SELECTOR_B, DIANA_PIN_BUTTON_ID,
            DIANA_PIN_HC165_DATA, DIANA_PIN_HC165_LOAD, DIANA_PIN_HC165_CLK,
        };
        const int reservados[] = {
            DIANA_PIN_RESERVED_IRQ_ANY, DIANA_PIN_RESERVED_A, DIANA_PIN_RESERVED_B,
        };
        int solapes = 0;
        for (size_t a = 0; a < sizeof(usados) / sizeof(usados[0]); ++a) {
            for (size_t b = 0; b < sizeof(reservados) / sizeof(reservados[0]); ++b) {
                if (usados[a] == reservados[b]) solapes++;
            }
        }
        CHECK_EQ_INT(solapes, 0, "ningun pin de reserva pisa una funcion en uso");
    }
#ifdef DIANA_ADC_CH_MUX
    CHECK(false, "el perfil DO-only no debe definir ADC de impacto");
#else
    CHECK(true, "sin DIANA_ADC_CH_MUX");
#endif

    /* --------------------------------------------------------------------
     * ADR-0007 · CONTRACT_GAP-FW-DETECTION-METHOD.
     * -------------------------------------------------------------------- */
    SECTION("el perfil de deteccion sale de la PLACA y coincide con la ruta");
    CHECK_EQ_INT(DIANA_DETECTION_PROFILE, DIANA_DETECT_DIGITAL_THRESHOLD,
                 "la placa fisica DO-only se declara digital_threshold");
    CHECK_EQ_STR(diana_detection_method_str(DIANA_DETECTION_PROFILE),
                 "digital_threshold",
                 "literal EXACTO del enum de hit-event.schema.json (ADR-0007)");
    CHECK_EQ_STR(diana_detection_method_str(DIANA_DETECT_ANALOG_ENVELOPE),
                 "analog_envelope", "literal EXACTO del perfil analogico");
    {
        /* La ruta que detecta ESTAMPA el perfil. Si la placa dijera una cosa y
         * la ruta hiciera otra, el discriminador seria una etiqueta decorativa. */
        diana_sensor_state pst;
        diana_sensor_state_init(&pst);
        diana_hit_group pg;
        diana_do_process_snapshot(&pst, &cfg, bit_for_target(1),
                                  DIANA_DO_ACTIVE_HIGH, 1500000, &pg);
        CHECK_EQ_INT(pg.detection_method, DIANA_DETECTION_PROFILE,
                     "la ruta 74HC165 estampa el perfil que declara la placa");

        /* Y la ruta analogica estampa el otro, tambien sin preguntar a nadie. */
        diana_config acfg2;
        diana_config_defaults(&acfg2);
        diana_piezo_trigger atrig = {3, 900, 2500};
        diana_hit_group agrp;
        diana_sensor_classify(&acfg2, &atrig, 1, &agrp);
        CHECK_EQ_INT(agrp.detection_method, DIANA_DETECT_ANALOG_ENVELOPE,
                     "la ruta con ADC estampa analog_envelope");
    }

    SECTION("D1-D9 mapean a bit0-bit8 con polaridad active-high");
    for (uint8_t target = 1; target <= DIANA_TARGET_COUNT; ++target) {
        diana_do_snapshot s;
        diana_do_decode(bit_for_target(target), DIANA_DO_ACTIVE_HIGH, &s);
        CHECK_EQ_INT(s.active_count, 1, "un unico canal activo");
        CHECK_EQ_INT(s.active_channels[0], target, "target segun bitmap");
        CHECK_EQ_INT(s.active_bitmap, bit_for_target(target), "bitmap preservado");
    }

    SECTION("bits 9-15 reservados se ignoran");
    diana_do_snapshot reserved;
    diana_do_decode(0xfe00u, DIANA_DO_ACTIVE_HIGH, &reserved);
    CHECK_EQ_INT(reserved.active_bitmap, 0, "reservados no generan impactos");
    CHECK_EQ_INT(reserved.active_count, 0, "sin canales activos");


    /* ===================================================================
     * La POLARIDAD QUE DECLARA LA PLACA, anclada a la medida de banco.
     * ===================================================================
     * Las secciones de arriba pasan la polaridad como argumento, asi que
     * comprueban que decode() sabe manejar ambas -- pero NINGUNA comprueba
     * que la placa declare la correcta. Se detecto invirtiendo
     * DIANA_DO_POLARITY en el header: la suite entera seguia en verde.
     *
     * El runtime SI usa el valor de la placa (io_hc165.c, app_tasks.c,
     * app_main.c), luego una placa mal declarada da un firmware que lee los
     * sensores al reves sin que nada avise.
     *
     * Banco 2026-08-23, con registros nuevos y divisor resistivo en D1-D3:
     * reposo medido 0 V y bus 0x0000; impacto ~5 V y bit propio a 1.
     * (La lectura del 2026-08-20 decia lo contrario, pero se tomo sobre un
     * 74HC165 averiado y sin adaptacion de nivel.)
     */

    /* ===================================================================
     * EQUIVALENCIA CON EL BUCLE VERIFICADO EN BANCO
     * ===================================================================
     * io_hc165.c NO se compila en las pruebas de host, asi que su cambio no
     * lo cubre ninguna suite. Y ese cambio no es cosmetico: el firmware
     * verificado en banco (3c51847) leia los sensores con
     *
     *     raw = (raw << 1) | gpio_get_level(SR_DATA);
     *
     * y ahora captura los bits en un array y llama a diana_shiftreg_pack().
     * Las medidas de banco D1=0x0001, D2=0x0002, D3=0x0004 se obtuvieron con
     * el bucle ORIGINAL. Si pack() ordenara los bits de otro modo, D1 apuntaria
     * a otra diana y nada avisaria.
     *
     * Aqui se reproduce el bucle original y se comparan AMBOS sobre las 65536
     * tramas posibles. No es una comprobacion de muestra: es exhaustiva.
     */
    SECTION("EQUIVALENCIA CON EL BUCLE VERIFICADO EN BANCO: pack() == (raw<<1)|bit");
    {
        diana_shiftreg_cfg sr;
        diana_shiftreg_cfg_defaults(&sr);

        int discrepantes = 0;
        for (uint32_t v = 0; v < 65536u; ++v) {
            uint8_t serie[16];
            for (int i = 0; i < 16; ++i) serie[i] = (uint8_t)((v >> (15 - i)) & 1u);

            uint16_t original = 0;                      /* el bucle de 3c51847 */
            for (int i = 0; i < 16; ++i)
                original = (uint16_t)((original << 1) | serie[i]);

