pjclavero/Diana/firmware/esp32/test_host/tests/test_do_only.c
            if (diana_shiftreg_pack(&sr, serie, 16) != original) ++discrepantes;
        }
        CHECK_EQ_INT(discrepantes, 0,
                     "las 65536 tramas dan lo mismo que el bucle verificado en banco");

        /* Los tres casos REALMENTE MEDIDOS el 2026-08-23, uno a uno. */
        const uint16_t esperado[3] = { 0x0001u, 0x0002u, 0x0004u };
        for (int d = 0; d < 3; ++d) {
            uint8_t serie[16] = {0};
            serie[15 - d] = 1;                          /* bit d en el resultado */
            CHECK_EQ_INT(diana_shiftreg_pack(&sr, serie, 16), esperado[d],
                         "D1/D2/D3 dan 0x0001/0x0002/0x0004 como en el monitor serie");
        }
    }

    SECTION("POLARIDAD DECLARADA POR LA PLACA: coincide con el banco 2026-08-23");
    CHECK(DIANA_DO_POLARITY == DIANA_DO_ACTIVE_HIGH,
          "la placa declara active-high, como se midio en banco");
    {
        /* Lo que de verdad importa no es el nombre de la constante, sino su
         * consecuencia: en reposo el bus vale 0x0000 y NO debe haber impactos.
         * Con active-low, ese mismo 0x0000 se leeria como las NUEVE dianas
         * golpeadas a la vez -- que es exactamente el sintoma que dio el
         * montaje averiado. */
        diana_do_snapshot reposo;
        diana_do_decode(0x0000u, DIANA_DO_POLARITY, &reposo);
        CHECK_EQ_INT(reposo.active_count, 0,
                     "bus en reposo (0x0000) con la polaridad de la placa: CERO impactos");

        diana_do_snapshot golpe;
        diana_do_decode(bit_for_target(1), DIANA_DO_POLARITY, &golpe);
        CHECK_EQ_INT(golpe.active_count, 1, "D1 a 1 con la polaridad de la placa: un impacto");
        CHECK_EQ_INT(golpe.active_channels[0], 1, "y es la diana 1");
    }

    SECTION("active-low invierte solo los 9 bits utiles");
    diana_do_snapshot low;
    diana_do_decode((uint16_t)~bit_for_target(4), DIANA_DO_ACTIVE_LOW, &low);
    CHECK_EQ_INT(low.active_count, 1, "active-low detecta un canal");
    CHECK_EQ_INT(low.active_channels[0], 4, "D4 detectada active-low");

    SECTION("ningun bit -> ningun impacto");
    diana_hit_group g;
    diana_do_process_snapshot(&st, &cfg, 0, DIANA_DO_ACTIVE_HIGH, 1000000, &g);
    CHECK(!g.accepted, "snapshot vacio no se acepta");
    CHECK_EQ_INT(g.target_index, 0, "no se asigna target");

    SECTION("D1 -> target 1, D9 -> target 9 sin amplitud inventada");
    diana_sensor_state_init(&st);
    diana_do_process_snapshot(&st, &cfg, bit_for_target(1), DIANA_DO_ACTIVE_HIGH,
                              2000000, &g);
    CHECK(g.accepted, "D1 aceptada");
    CHECK_EQ_INT(g.target_index, 1, "D1 target_index 1");
    CHECK(!g.has_amplitude, "sin amplitud en DO-only");
    CHECK(!g.has_threshold, "sin umbral ADC en DO-only");

    diana_do_process_snapshot(&st, &cfg, 0, DIANA_DO_ACTIVE_HIGH, 2065000, &g);
    diana_do_process_snapshot(&st, &cfg, bit_for_target(9), DIANA_DO_ACTIVE_HIGH,
                              2120000, &g);
    CHECK(g.accepted, "D9 aceptada tras refractory");
    CHECK_EQ_INT(g.target_index, 9, "D9 target_index 9");

    SECTION("D1+D2 -> MULTI_TRIGGER diagnostico/no puntuable");
    diana_sensor_state_init(&st);
    diana_do_process_snapshot(&st, &cfg, bit_for_target(1) | bit_for_target(2),
                              DIANA_DO_ACTIVE_HIGH, 3000000, &g);
    CHECK(!g.accepted, "multi-trigger no se acepta");
    CHECK_EQ_INT(g.target_index, 0, "no se elige bit menor ni primero");
    CHECK(strstr(g.reason, "MULTI_TRIGGER") != NULL, "motivo MULTI_TRIGGER");
    CHECK_EQ_INT(g.active_count, 2, "dos canales activos registrados");

    SECTION("rebote -> un unico evento; nuevo impacto tras refractory");
    diana_sensor_state_init(&st);
    diana_do_process_snapshot(&st, &cfg, bit_for_target(3), DIANA_DO_ACTIVE_HIGH,
                              4000000, &g);
    CHECK(g.accepted, "primer impacto D3");
    diana_do_process_snapshot(&st, &cfg, 0, DIANA_DO_ACTIVE_HIGH, 4000100, &g);
    diana_do_process_snapshot(&st, &cfg, bit_for_target(3), DIANA_DO_ACTIVE_HIGH,
                              4000500, &g);
    CHECK(!g.accepted, "rebote dentro de ventana rechazado");
    diana_do_process_snapshot(&st, &cfg, 0, DIANA_DO_ACTIVE_HIGH, 4061000, &g);
    diana_do_process_snapshot(&st, &cfg, bit_for_target(3), DIANA_DO_ACTIVE_HIGH,
                              4062000, &g);
    CHECK(g.accepted, "nuevo impacto tras refractory");

    /* --------------------------------------------------------------------
     * RESCATE desde hw/do-only-v1: el convenio de cableado de la cascada
     * estaba solo dentro del bucle de bit-banging de io_hc165.c, que no
     * compila en host y que por tanto ninguna prueba podia tocar.
     * -------------------------------------------------------------------- */
    /* --------------------------------------------------------------------
     * RESCATE desde hw/do-only-v1: contadores de calibracion. Sin amplitud no
     * se puede rechazar crosstalk por software; lo unico honesto es MEDIRLO.
     * -------------------------------------------------------------------- */
    SECTION("contadores de calibracion por diana, multi-trigger y capturas");
    {
        diana_sensor_state cst;
        diana_sensor_state_init(&cst);
        diana_hit_group cg;
        uint64_t t = 10000000;

        CHECK_EQ_INT(cst.diag.capture_count, 0, "arranca sin capturas");
        CHECK_EQ_INT(cst.diag.last_target, 0, "arranca sin ultima diana");

        /* Tres impactos en D4, espaciados por encima del refractario. */
        for (int k = 0; k < 3; ++k) {
            diana_do_process_snapshot(&cst, &cfg, bit_for_target(4),
                                      DIANA_DO_ACTIVE_HIGH, t, &cg);
            CHECK(cg.accepted, "impacto D4 aceptado");
            t += 100000;
            diana_do_process_snapshot(&cst, &cfg, 0, DIANA_DO_ACTIVE_HIGH, t, &cg);
            t += 100000;
        }
        diana_do_process_snapshot(&cst, &cfg, bit_for_target(9),
                                  DIANA_DO_ACTIVE_HIGH, t, &cg);
        CHECK(cg.accepted, "impacto D9 aceptado");
        uint64_t t_d9 = t;
        t += 100000;
        diana_do_process_snapshot(&cst, &cfg, 0, DIANA_DO_ACTIVE_HIGH, t, &cg);
        t += 100000;

        uint16_t both = (uint16_t)(bit_for_target(2) | bit_for_target(7));
        diana_do_process_snapshot(&cst, &cfg, both, DIANA_DO_ACTIVE_HIGH, t, &cg);

        CHECK_EQ_INT(cst.diag.trigger_count[3], 3, "D4 acumula 3 disparos");
        CHECK_EQ_INT(cst.diag.trigger_count[8], 1, "D9 acumula 1 disparo");
        CHECK_EQ_INT(cst.diag.trigger_count[1], 0,
                     "D2 no acumula: el multi-trigger NO se atribuye a nadie");
        CHECK_EQ_INT(cst.diag.trigger_count[6], 0,
                     "D7 tampoco: sin amplitud no se elige un canal");
        CHECK_EQ_INT(cst.diag.last_target, 9,
                     "ultima diana aceptada = D9, el multi no elige ninguna");
        CHECK_EQ_INT(cst.diag.last_trigger_us, t_d9, "marca de tiempo de D9");
        CHECK_EQ_INT(cst.diag.multi_trigger_count, 1, "1 multi-trigger contado");
        CHECK_EQ_INT(cst.diag.last_multi_trigger_us, t, "marca del multi-trigger");
        CHECK_EQ_INT(cst.diag.last_active_bitmap, both,
                     "ultimo bitmap activo = D2+D7");
        CHECK_EQ_INT(cst.diag.capture_count, 9,
                     "9 capturas procesadas: denominador honesto");

