pjclavero/Diana/firmware/esp32/test_host/tests/test_do_only.c
        SECTION("los rebotes suprimidos se cuentan, no se pierden en silencio");
        {
            diana_sensor_state bst;
            diana_sensor_state_init(&bst);
            diana_hit_group bg;
            diana_do_process_snapshot(&bst, &cfg, bit_for_target(6),
                                      DIANA_DO_ACTIVE_HIGH, 20000000, &bg);
            CHECK(bg.accepted, "primer impacto D6");
            diana_do_process_snapshot(&bst, &cfg, 0, DIANA_DO_ACTIVE_HIGH,
                                      20000100, &bg);
            diana_do_process_snapshot(&bst, &cfg, bit_for_target(6),
                                      DIANA_DO_ACTIVE_HIGH, 20000500, &bg);
            CHECK(!bg.accepted, "rebote rechazado");
            CHECK_EQ_INT(bst.suppressed_debounce[5], 1,
                         "el rebote suprimido queda contado en D6");
            CHECK_EQ_INT(bst.diag.trigger_count[5], 1,
                         "el rebote NO cuenta como disparo aceptado");
            CHECK_EQ_INT(bst.diag.capture_count, 3,
                         "las tres capturas cuentan, tambien la del rebote");
        }

        SECTION("el reset de contadores no toca el estado de deteccion");
        {
            uint16_t last = cst.do_last_active_bitmap;
            uint64_t blank = cst.blanking_until_us[3];
            diana_sensor_diag_reset(&cst);
            CHECK_EQ_INT(cst.diag.capture_count, 0, "capturas a cero");
            CHECK_EQ_INT(cst.diag.trigger_count[3], 0, "D4 a cero");
            CHECK_EQ_INT(cst.diag.multi_trigger_count, 0, "multi a cero");
            CHECK_EQ_INT(cst.do_last_active_bitmap, last,
                         "el borde activo NO se reinicia");
            CHECK_EQ_INT(cst.blanking_until_us[3], blank,
                         "el refractario de D4 NO se reinicia");
        }
    }

    SECTION("orden de la cascada: #1 QH -> #2 SER -> ESP32 GPIO38");
    {
        diana_shiftreg_cfg sr;
        diana_shiftreg_cfg_defaults(&sr);
        CHECK_EQ_INT(sr.total_bits, DIANA_HC165_BITS,
                     "la trama del modulo coincide con DIANA_HC165_BITS de la placa");

        /* Solo D1 = registro #1 entrada A = ULTIMO bit de la secuencia serie. */
        uint8_t s_d1[DIANA_SR_TOTAL_BITS] = {0};
        s_d1[15] = 1;
        CHECK_EQ_INT(diana_shiftreg_pack(&sr, s_d1, DIANA_SR_TOTAL_BITS), 1u << 0,
                     "ultimo bit de la secuencia = #1 entrada A = D1 (bit 0)");

        /* Solo D8 = registro #1 entrada H = primer bit del bloque del #1. */
        uint8_t s_d8[DIANA_SR_TOTAL_BITS] = {0};
        s_d8[8] = 1;
        CHECK_EQ_INT(diana_shiftreg_pack(&sr, s_d8, DIANA_SR_TOTAL_BITS), 1u << 7,
                     "bit 8 de la secuencia = #1 entrada H = D8 (bit 7)");

        /* Solo D9 = registro #2 entrada A = ultimo bit del bloque del #2. */
        uint8_t s_d9[DIANA_SR_TOTAL_BITS] = {0};
        s_d9[7] = 1;
        CHECK_EQ_INT(diana_shiftreg_pack(&sr, s_d9, DIANA_SR_TOTAL_BITS), 1u << 8,
                     "bit 7 de la secuencia = #2 entrada A = D9 (bit 8)");

        /* Trama de longitud distinta: no se adivina. Se usa s_d9, cuyo bit
         * activo cae DENTRO de los 8 primeros: con s_d1 el resultado seria 0
         * por casualidad y la comprobacion no sabria ponerse roja. */
        CHECK_EQ_INT(diana_shiftreg_pack(&sr, s_d9, 8), 0,
                     "longitud distinta de total_bits -> 0, no se supone nada");


        SECTION("tabla explicita bit -> diana, incluida la reserva");
        for (uint8_t d = 1; d <= DIANA_TARGET_COUNT; ++d) {
            uint8_t bit = diana_shiftreg_target_bit(&sr, d);
            CHECK_EQ_INT(bit, (uint8_t)(d - 1u), "cada diana en su bit");
            CHECK_EQ_INT(diana_shiftreg_bit_target(&sr, bit), d,
                         "el bit devuelve su diana");
        }
        for (uint8_t b = DIANA_TARGET_COUNT; b < DIANA_SR_TOTAL_BITS; ++b) {
            CHECK_EQ_INT(diana_shiftreg_bit_target(&sr, b), 0,
                         "los bits 9-15 son reserva, no diana");
        }
        CHECK_EQ_INT(diana_shiftreg_target_bit(&sr, 0), 0xFF,
                     "diana 0 no existe");

        SECTION("pack equivale al bucle real de io_hc165.c");
        {
            /* Referencia: EXACTAMENTE el bucle de la capa de plataforma.
             * Si alguien cambia uno de los dos, esta prueba se pone roja. */
            static const uint8_t vectores[6][DIANA_SR_TOTAL_BITS] = {
                {0},
                {1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},
                {0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0},
                {1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0},
                {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
                {1,1,0,0,1,0,0,1,0,1,1,0,0,0,1,1},
            };
            for (size_t v = 0; v < 6; ++v) {
                uint16_t ref = 0;
                for (uint8_t i = 0; i < DIANA_SR_TOTAL_BITS; ++i) {
                    ref = (uint16_t)((ref << 1) | (uint16_t)vectores[v][i]);
                }
                CHECK_EQ_INT(diana_shiftreg_pack(&sr, vectores[v],
                                                 DIANA_SR_TOTAL_BITS),
                             ref, "pack reproduce el bucle de la ISR");
            }
        }

        SECTION("la palabra empaquetada alimenta la decodificacion DO");
        {
            uint8_t s_d5[DIANA_SR_TOTAL_BITS] = {0};
            s_d5[11] = 1;  /* #1 entrada E -> D5 -> bit 4 */
            uint16_t raw = diana_shiftreg_pack(&sr, s_d5, DIANA_SR_TOTAL_BITS);
            diana_do_snapshot s;
            diana_do_decode(raw, DIANA_DO_ACTIVE_HIGH, &s);
            CHECK_EQ_INT(s.active_count, 1, "una diana desde la trama serie");
            CHECK_EQ_INT(s.active_channels[0], 5, "la trama serie de D5 da D5");
        }
    }

    SECTION("selector 2 posiciones actual");
    diana_selector_position pos = DIANA_SELECTOR_AUTO;
    CHECK_EQ_INT(diana_selector_decode(0, 1, DIANA_SELECTOR_2_POSITION, &pos),
                 DIANA_HAL_OK, "LOW/HIGH valido");
    CHECK_EQ_STR(diana_selector_str(pos), "PRINCIPAL", "LOW/HIGH -> PRINCIPAL");
    CHECK_EQ_INT(diana_selector_decode(1, 0, DIANA_SELECTOR_2_POSITION, &pos),
                 DIANA_HAL_OK, "HIGH/LOW valido");
    CHECK_EQ_STR(diana_selector_str(pos), "SATELITE", "HIGH/LOW -> SATELITE");
    CHECK(diana_selector_decode(1, 1, DIANA_SELECTOR_2_POSITION, &pos) != 0,
          "HIGH/HIGH invalido en SPDT actual");
    CHECK(diana_selector_decode(0, 0, DIANA_SELECTOR_2_POSITION, &pos) != 0,
          "LOW/LOW invalido");

    SECTION("selector 3 posiciones futuro");
    CHECK_EQ_INT(diana_selector_decode(1, 1, DIANA_SELECTOR_3_POSITION, &pos),
                 DIANA_HAL_OK, "HIGH/HIGH valido con ON-OFF-ON");
    CHECK_EQ_STR(diana_selector_str(pos), "AUTO", "HIGH/HIGH -> AUTO");
    CHECK(diana_selector_decode(0, 0, DIANA_SELECTOR_3_POSITION, &pos) != 0,
          "LOW/LOW sigue siendo error");

    SECTION("IDENTIFY activo bajo via HAL host");
    host_persistent nv;
    host_hal_ctx ctx;
    diana_hal hal;
    host_persistent_reset(&nv, 4);
    host_hal_init(&ctx, &nv, &hal, 9);
    ctx.button = false;
    CHECK(!hal.button_pressed(hal.ctx), "sin pulsar = HIGH/no activo");
    ctx.button = true;
    CHECK(hal.button_pressed(hal.ctx), "pulsado = LOW/activo");

    SECTION("hit-event digital omite amplitud y umbral");
    diana_identity id;
    diana_identity_load(&id, &hal, "0.1.0");
    diana_identity_provision(&id, &hal, "module-03", "system-a", "S", "proto-do",
                             "u", "p");
    diana_sensor_state_init(&st);
    diana_do_process_snapshot(&st, &cfg, bit_for_target(5), DIANA_DO_ACTIVE_HIGH,
                              5000000, &g);
    diana_hit_event ev;
    diana_hit_event_build(&ev, &hal, &id, &g, DIANA_TARGET_ACTIVE, 5000010);
    CHECK_EQ_INT(diana_hit_event_check(&ev), 0, "evento digital valido localmente");
    char json[DIANA_HIT_JSON_MAX];
    size_t n = diana_hit_event_to_json(&ev, json, sizeof(json));
    CHECK(n > 0, "evento digital serializado");
    CHECK(strstr(json, "\"amplitude\"") == NULL, "sin campo amplitude");
    CHECK(strstr(json, "\"threshold\"") == NULL, "sin campo threshold");
    /* ADR-0007: este payload lleva detection_method y por tanto SOLO es valido
     * contra el contrato reconciliado. Se valida en su propio pase; el contrato
     * congelado de esta base no conoce el campo. */
    dump_message_adr0007("hit-event.schema.json", "hit_digital_do", json);

    /* --------------------------------------------------------------------
     * RESCATE desde hw/do-only-v1: prueba ANTIRREGRESION del ADC.
     * Se pone roja si alguien reintroduce una lectura de amplitud en la ruta
     * de impacto de V1. Se hace con el HAL COMPLETO (piezo_amplitude
     * DISPONIBLE) a proposito: con el puntero a NULL, una llamada protegida
     * por guarda (`if (hal->piezo_amplitude) ...`) pasaria inadvertida.
     * -------------------------------------------------------------------- */
    SECTION("antirregresion: la ruta DO-only NO lee el ADC ni una vez");
    CHECK(hal.piezo_amplitude != NULL,
          "el HAL de host SI ofrece el ADC: la prueba no es vacia");
    ctx.piezo_reads = 0;
    diana_sensor_state ast;
    diana_sensor_state_init(&ast);
    diana_hit_group ag;
    uint64_t at = 6000000;
    int ahits = 0;
    for (uint8_t d = 1; d <= DIANA_TARGET_COUNT; ++d) {
        diana_do_process_snapshot(&ast, &cfg, bit_for_target(d),
                                  DIANA_DO_ACTIVE_HIGH, at, &ag);
        if (ag.accepted && ag.target_index == d) ahits++;
        at += 100000;
        diana_do_process_snapshot(&ast, &cfg, 0, DIANA_DO_ACTIVE_HIGH, at, &ag);
        at += 100000;
    }
    CHECK_EQ_INT(ahits, 9, "las nueve dianas se detectan sin tocar el ADC");
    CHECK_EQ_INT(ctx.piezo_reads, 0,
                 "ANTIRREGRESION: CERO lecturas de ADC al detectar");

    diana_sensor_state_init(&ast);
    diana_do_process_snapshot(&ast, &cfg, bit_for_target(8),
                              DIANA_DO_ACTIVE_HIGH, 7000000, &ag);
    diana_hit_event aev;
    diana_hit_event_build(&aev, &hal, &id, &ag, DIANA_TARGET_ACTIVE, 7000010);
    CHECK_EQ_INT(ctx.piezo_reads, 0,
                 "ANTIRREGRESION: construir el evento tampoco lee el ADC");
    CHECK(!aev.has_amplitude,
          "ANTIRREGRESION: tener ADC disponible no hace aparecer amplitude");
    CHECK(!aev.has_threshold, "ANTIRREGRESION: ni threshold");
    CHECK(!aev.has_noise_floor, "ANTIRREGRESION: ni noise_floor");
    CHECK_EQ_INT(aev.neighbour_count, 0,
                 "sin amplitud no hay vecinos auditables que emitir");

