pjclavero/Diana/firmware/esp32/test_host/tests/test_do_only.c
    char ajson[DIANA_HIT_JSON_MAX];
    size_t an = diana_hit_event_to_json(&aev, ajson, sizeof(ajson));
    CHECK(an > 0, "el evento DO-only con HAL completo se serializa");
    CHECK_EQ_INT(ctx.piezo_reads, 0,
                 "ANTIRREGRESION: serializar tampoco lee el ADC");
    CHECK(strstr(ajson, "\"amplitude\"") == NULL,
          "ANTIRREGRESION: el JSON no lleva amplitude, ni con valor cero");

    SECTION("ADR-0007: coherencia perfil <-> medidas, impuesta por construccion");
    {
        /* 1. El evento digital NO puede nacer con medidas analogicas, aunque el
         *    grupo las traiga por un error aguas arriba. */
        diana_sensor_state cst2;
        diana_sensor_state_init(&cst2);
        diana_hit_group dirty;
        diana_do_process_snapshot(&cst2, &cfg, bit_for_target(2),
                                  DIANA_DO_ACTIVE_HIGH, 8000000, &dirty);
        CHECK(dirty.accepted, "impacto digital aceptado");
        dirty.has_amplitude = true;   /* contaminacion deliberada del grupo */
        dirty.amplitude = 1234;
        dirty.has_threshold = true;
        dirty.threshold = 900;
        dirty.has_noise_floor = true;
        dirty.noise_floor = 12;

        diana_hit_event dev;
        diana_hit_event_build(&dev, &hal, &id, &dirty, DIANA_TARGET_ACTIVE,
                              8000010);
        CHECK_EQ_INT(dev.detection_method, DIANA_DETECT_DIGITAL_THRESHOLD,
                     "el evento hereda el perfil digital");
        CHECK(!dev.has_amplitude,
              "el build DESCARTA la amplitud en el perfil digital");
        CHECK(!dev.has_threshold, "y el umbral");
        CHECK(!dev.has_noise_floor, "y el suelo de ruido");
        CHECK_EQ_INT(dev.amplitude, 0,
                     "el valor se limpia, no se arrastra escondido");
        CHECK(diana_hit_event_profile_coherent(&dev), "el evento es coherente");
        CHECK_EQ_INT(diana_hit_event_check(&dev), DIANA_HAL_OK,
                     "y pasa la comprobacion previa a publicar");

        char djson[DIANA_HIT_JSON_MAX];
        size_t dn = diana_hit_event_to_json(&dev, djson, sizeof(djson));
        CHECK(dn > 0, "el evento digital se serializa");
        CHECK(strstr(djson, "\"detection_method\":\"digital_threshold\"") != NULL,
              "el JSON lleva el discriminador con el literal exacto");
        CHECK(strstr(djson, "\"amplitude\"") == NULL,
              "PROHIBIDO: sin amplitude en el perfil digital");
        CHECK(strstr(djson, "\"threshold\"") == NULL, "sin threshold");
        CHECK(strstr(djson, "\"noise_floor\"") == NULL, "sin noise_floor");

        /* 2. Un evento INCOHERENTE forzado a mano no se puede serializar. */
        diana_hit_event bad = dev;
        bad.has_amplitude = true;
        bad.amplitude = 777;
        CHECK(!diana_hit_event_profile_coherent(&bad),
              "digital + amplitud = incoherente");
        CHECK_EQ_INT(diana_hit_event_check(&bad),
                     DIANA_ERR_CONTRACT_PROFILE_MISMATCH,
                     "codigo de error propio, distinguible de evento invalido");
        CHECK(diana_hit_event_check(&bad) != DIANA_HAL_ERR_INVALID,
              "no se confunde con un evento mal formado");
        char bjson[DIANA_HIT_JSON_MAX];
        CHECK_EQ_INT(diana_hit_event_to_json(&bad, bjson, sizeof(bjson)), 0,
                     "el serializador se NIEGA: un payload incoherente no existe");

        /* 2b. Vecinos en perfil digital: pueden viajar con su desfase temporal,
         *     pero su AMPLITUD esta prohibida. Hoy la ruta DO-only no produce
         *     vecinos; se fuerza a mano para que la rama del serializador no
         *     sea una afirmacion sin prueba. */
        diana_hit_event nb = dev;
        nb.neighbour_count = 1;
        nb.neighbours[0].target_index = 3;
        nb.neighbours[0].amplitude = 4242;
        nb.neighbours[0].delta_us = -180;
        char njson[DIANA_HIT_JSON_MAX];
        size_t nn = diana_hit_event_to_json(&nb, njson, sizeof(njson));
        CHECK(nn > 0, "el evento digital con vecino se serializa");
        CHECK(strstr(njson, "\"delta_us\":-180") != NULL,
              "el desfase temporal del vecino SI viaja: es lo unico que queda");
        CHECK(strstr(njson, "4242") == NULL,
              "PROHIBIDO: la amplitud del vecino no aparece en perfil digital");
        CHECK(strstr(njson, "\"amplitude\"") == NULL,
              "ni la clave amplitude en ninguna parte del payload digital");
        dump_message_adr0007("hit-event.schema.json", "hit_digital_neighbour",
                             njson);

        /* 3. Simetria: un analogico SIN amplitud tampoco es coherente. Es el
         *    productor averiado que ADR-0007 vuelve a hacer detectable. */
        diana_hit_event lame = dev;
        lame.detection_method = DIANA_DETECT_ANALOG_ENVELOPE;
        lame.has_amplitude = false;
        lame.has_threshold = false;
        CHECK(!diana_hit_event_profile_coherent(&lame),
              "analogico sin amplitud = productor averiado, no DO-only");
        CHECK_EQ_INT(diana_hit_event_to_json(&lame, bjson, sizeof(bjson)), 0,
                     "tampoco se serializa");

        /* 4. El perfil analogico legitimo sigue funcionando y NO emite el
         *    discriminador: la ausencia ya equivale a analog_envelope y los
         *    payloads v1 anteriores al ADR no cambian ni un byte. */
        diana_config acfg3;
        diana_config_defaults(&acfg3);
        diana_piezo_trigger atrig3 = {4, 900, 2600};
        diana_hit_group agrp3;
        diana_sensor_classify(&acfg3, &atrig3, 1, &agrp3);
        diana_hit_event aev3;
        diana_hit_event_build(&aev3, &hal, &id, &agrp3, DIANA_TARGET_ACTIVE, 900);
        CHECK_EQ_INT(aev3.detection_method, DIANA_DETECT_ANALOG_ENVELOPE,
                     "la ruta con ADC produce un evento analogico");
        CHECK(aev3.has_amplitude, "que SI lleva amplitud");
        CHECK_EQ_INT(diana_hit_event_check(&aev3), DIANA_HAL_OK, "y es coherente");
        size_t an3 = diana_hit_event_to_json(&aev3, bjson, sizeof(bjson));
        CHECK(an3 > 0, "el evento analogico se serializa");
        CHECK(strstr(bjson, "detection_method") == NULL,
              "el analogico NO emite el discriminador: ausencia == analogico");
        CHECK(strstr(bjson, "\"amplitude\"") != NULL,
              "y su amplitud sigue siendo obligatoria");
    }

    /* Y la via analogica (PCB futura) sigue intacta: SI lee el ADC.
     * Esto demuestra que el contador funciona y que la comprobacion de arriba
     * no es verde por estar el instrumento roto. */
    SECTION("control positivo: la ruta analogica SI usa el ADC");
    uint16_t amp = 0;
    CHECK_EQ_INT(hal.piezo_amplitude(hal.ctx, 0, &amp), DIANA_HAL_OK,
                 "lectura de amplitud disponible para la PCB futura");
    CHECK_EQ_INT(ctx.piezo_reads, 1,
                 "el contador de lecturas de ADC funciona de verdad");

    return g_tests_failed - before;
}
